# 01. Import libraries

In [17]:
# import libraries
import pandas as pd
import numpy as np
import os

# 02. Setting variable

In [18]:
path = r'C:\Users\paulo\04-2024 Instacart Basket Analysis'

In [19]:
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [20]:
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders.csv'), index_col = False)

In [7]:
# Creating a dataframe

df_test = pd.DataFrame()

In [8]:
# Creating a mixed type column

df_test['mix'] = ['a', 'b', 1, True]

In [9]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [29]:
# Finding missing values

In [10]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [1]:
# Assigning missing values to a variable df_nan

In [13]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [14]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [2]:
# Checking the original shape of df_prods DataFrame

In [15]:
df_prods.shape

(49693, 5)

In [3]:
# Cleaning missing values

In [20]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [8]:
# Checking the new shape without missing values

In [21]:
df_prods_clean.shape

(49677, 5)

In [31]:
# Finding duplicates

df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [23]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [5]:
# Checking the original number of rows for df_prods_clean DataFrame

In [24]:
df_prods_clean.shape

(49677, 5)

In [32]:
# Cleaning duplicates

In [27]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [7]:
# Checking the new shape without duplicates

In [28]:
df_prods_clean_no_dups.shape

(49672, 5)

# 03. Export data

In [65]:
# Export your df_prods dataframe 
# as “prodcts_checked.csv” in your “Prepared Data” folder.

df_prods.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))

# 04. Exercise - Consistency checks df_ords

In [9]:
# 2. Run the df.describe() function on your df_ords dataframe. 
# Using your new knowledge about how to interpret the output of this 
# function, share in a markdown cell whether anything about the data 
# looks off or should be investigated further.

In [21]:
df_ords.describe()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [23]:
# Answer:

# For the min of the order_dow 0 and the max of 6 is expect as we have
# 7 days of the week, as for order_hour_of_day is accurate as we won't
# find anything over 24 hours.

In [ ]:
# 3. Check for mixed-type data in your df_ords dataframe.

In [30]:
for col in df_ords.columns.tolist():
    weird = (df_ords[[col]].map(type) != df_ords [[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_ords[weird]) > 0:
        print (col)
else:
        print ("None of the columns have mix data")

None of the columns have mix data

In [31]:
# Answer:

# No mixed data was found.

In [32]:
# 5. Run a check for missing values in your df_ords dataframe.
# In a markdown cell, report your findings and propose an explanation 
# for any missing values you find.

In [33]:
df_ords.isnull().sum()

order_id                       0
user_id                        0
eval_set                       0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [34]:
# Answer:

# There are 206,209 missing values for the days_since _prior_order. 
# Delete this number would be a mistake as this value being null indicates
# that the user has made his first order.

In [35]:
# 6. Address the missing values using an appropriate method.
# In a markdown cell, explain why you used your method of choice.

In [36]:
# Extract the missing values to a subset variable.

In [40]:
df_nan = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [41]:
df_nan

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
11,2168274,2,prior,1,2,11,NaN
26,1374495,3,prior,1,1,14,NaN
39,3343014,4,prior,1,6,11,NaN
45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,969311,206205,prior,1,4,12,NaN
3420934,3189322,206206,prior,1,3,18,NaN
3421002,2166133,206207,prior,1,6,19,NaN
3421019,2227043,206208,prior,1,1,15,NaN
3421069,3154581,206209,prior,1,3,11,NaN

In [43]:
# A pattern was seen, order_numbers appears to be all 1 
# Check if all the null values comes from number_order = 1

In [48]:
df_nan['order_number'].value_counts()

order_number
1    206209
Name: count, dtype: int64

In [49]:
# Check frequency of order_number is =1 in df_ords

In [50]:
df_ords['order_number'].value_counts()

order_number
1      206209
2      206209
3      206209
4      206209
5      182223
        ...
96       1592
97       1525
98       1471
99       1421
100      1374
Name: count, Length: 100, dtype: int64

In [51]:
df_ords_first_order = df_ords

In [56]:
# Creating a new column and the value is wether 
# order_number == 1 using numpy.
df_ords_first_order['is_first_order'] = np.where(df_ords_first_order['order_number'] == 1, True, False)

In [57]:
df_ords_first_order.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,is_first_order
0,2539329,1,prior,1,2,8,NaN,True
1,2398795,1,prior,2,3,7,15.0,False
2,473747,1,prior,3,3,12,21.0,False
3,2254736,1,prior,4,4,7,29.0,False
4,431534,1,prior,5,4,15,28.0,False

In [58]:
# Answer:

# The missing values were not deleted. To solve it a new column was 
# created defining wether the order was the first order from the user.

In [59]:
# 7. Run a check for duplicate values in your df_ords data.
# In a markdown cell, report your findings and propose an explanation 
# for any duplicate values you find.

In [61]:
df_ords_dups = df_ords[df_ords_first_order.duplicated()]

In [62]:
df_ords_dups

Empty DataFrame
Columns: [order_id, user_id, eval_set, order_number, order_dow, order_hour_of_day, days_since_prior_order, is_first_order]
Index: []

In [63]:
# Answer:

# No duplicates were found.

# 05. Export data

In [64]:
# 9. Export your final, cleaned df_prods and df_ords data as “.csv” 
# files in your “Prepared Data” folder and give them appropriate, 
# succinct names.

In [66]:
df_ords_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))